api/app/services/balance.rb

SELECT "balances".* FROM "balances" WHERE "balances"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
def balance_user(user_id)
  balance_User = Balance.find_by({ user_id: user_id })