api/app/services/checkUser.rb

def checkUser(user)
  response = User.find_by(username: user)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]