api/app/services/details_user.rb

def details_user(id)
  return Transaction.find(id)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]