api/app/services/validate_create.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "5"], ["password", "123456"], ["created_at", "2021-09-10 02:43:45.000986"], ["updated_at", "2021-09-10 02:43:45.000986"]]
INSERT INTO "balances" ("btc", "usd", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["btc", "0.1"], ["usd", "1000.0"], ["created_at", "2021-09-10 02:43:45.012508"], ["updated_at", "2021-09-10 02:43:45.012508"], ["user_id", 3]]
---
def validate_create(response, username, password)
  if response == 'No Usuario'
    status =
      User.create({ username: params[:username], password: params[:password] })
    saldo = Balance.create({ btc: 0.1, usd: 1000, user_id: status.id })