api/app/services/validate_trade.rb

INSERT INTO "transactions" ("type_transaction", "coin_send", "coin_receive", "total_send", "total_receive", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "balances".* FROM "balances" WHERE "balances"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
UPDATE "balances" SET "btc" = $1, "usd" = $2, "updated_at" = $3 WHERE "balances"."id" = $4  [["btc", "0.09997861549226220034"], ["usd", "1001.0"], ["updated_at", "2021-09-10 02:54:07.892352"], ["id", 1]]
---
def validate_trade(
  user_id,
  type_transaction,
  coin_send,
  coin_receive,
  total_send,
  total_receive
)
  transaction_user =
    Transaction.create(
      {
        user_id: user_id,
        type_transaction: type_transaction,
        coin_send: coin_send,
        coin_receive: coin_receive,
        total_send: total_send,
        total_receive: total_receive,
      },
    )

  balance_user = Balance.find_by(user_id: user_id)

  if coin_receive == 'usd'
    if balance_user[:btc] > total_send
      balance_user[:btc] = balance_user[:btc] - total_send
      balance_user[:usd] = balance_user[:usd] + total_receive
      balance_user.save

UPDATE "balances" SET "btc" = $1, "usd" = $2, "updated_at" = $3 WHERE "balances"."id" = $4  [["btc", "0.10093521640239707978"], ["usd", "956.917783"], ["updated_at", "2021-09-10 12:29:44.566851"], ["id", 1]]
---
    if balance_user[:usd] > total_send
      balance_user[:btc] = balance_user[:btc] + total_receive
      balance_user[:usd] = balance_user[:usd] - total_send
      balance_user.save